app/Controllers/Admin.php

    public function users()
    {
        $session = session();

        // Authorization: ensure user is logged in and is an admin
        if (!$session->get('isLoggedIn')) {
            $session->setFlashdata('login_error', 'Please login to access the dashboard.');
            return redirect()->to('login');
        }

        if ($session->get('role') !== 'admin') {
            $session->setFlashdata('error', 'Access Denied: Insufficient Permissions');
            return redirect()->to('/dashboard');
        }

        // Check if user account is active
        $user = $this->userModel->find($session->get('user_id'));
        if (!$user || ($user['status'] ?? 'active') !== 'active') {
            $session->destroy();
            $session->setFlashdata('login_error', 'Your account has been deactivated.');
            return redirect()->to('login');
        }

        $users = $this->userModel->findAll(); // Show all users including inactive
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `users`