app/Controllers/Assignment.php

SELECT *
FROM `courses`
WHERE `courses`.`id` = '2'
---
    public function create($courseId)
    {
        if (!session()->get('isLoggedIn') || !in_array(session()->get('role'), ['teacher', 'admin'])) {
            return redirect()->to('/login')->with('error', 'Access denied');
        }

        $course = $this->courseModel->find($courseId);