app/Controllers/auth.php

	public function login()
	{
		helper(['form']);
		$session = session();

		if ($this->request->getMethod() === 'POST') {
			$rules = [
				'email' => 'required|valid_email',
				'password' => 'required'
			];

			if ($this->validate($rules)) {
				$email = $this->request->getPost('email');
				$password = $this->request->getPost('password');

				try {
					$model = new UserModel();

					// Find user by email only
					$user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'student@example.com'
 LIMIT 1

	public function dashboard()
	{
		$session = session();

		// Authorization: ensure user logged in
		if (!$session->get('isLoggedIn')) {
			$session->setFlashdata('login_error', 'Please login to access the dashboard.');
			return redirect()->to('login');
		}

		// Check if user account is active
		$userModel = new UserModel();
		$user = $userModel->find($session->get('user_id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

				];
			} catch (\Exception $e) {
				log_message('error', 'Error loading admin dashboard data: ' . $e->getMessage());
				$adminData = [
					'totalUsers' => model(UserModel::class)->countAllResults(),
					'latestUsers' => model(UserModel::class)
						->orderBy('created_at', 'DESC')
						->limit(5)
						->find(),
					'recentLogins' => [],
					'loginStatsByRole' => [],
					'recentUniqueUsers' => [],
				];
---
SELECT *
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `users`