app/Controllers/Notifications.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function get()
    {
        if (!session('isLoggedIn')) {
            return $this->respond(['error' => 'Unauthorized'], 401);
        }

        // Check if user account is active
        $userModel = new \App\Models\UserModel();
        $user = $userModel->find(session('user_id'));