app/Models/AnnouncementModel.php

SELECT *
FROM `announcements`
WHERE `is_active` = 1
AND   (
`target_audience` = 'admin'
OR `target_audience` = 'all'
 )
AND   (
`expires_at` IS NULL
OR `expires_at` > '2025-12-12 12:35:17'
 )
ORDER BY `priority` DESC, `created_at` DESC
 LIMIT 999
---
    public function getActiveAnnouncementsFor($audience = 'all', $limit = 5)
    {
        $builder = $this->where('is_active', 1);

        // Filter by target audience
        if ($audience !== 'all') {
            $builder->groupStart()
                   ->where('target_audience', $audience)
                   ->orWhere('target_audience', 'all')
                   ->groupEnd();
        }

        // Filter out expired announcements
        $builder->groupStart()
               ->where('expires_at IS NULL')
               ->orWhere('expires_at >', date('Y-m-d H:i:s'))
               ->groupEnd();

        return $builder->orderBy('priority', 'DESC')
                      ->orderBy('created_at', 'DESC')
                      ->limit($limit)
                      ->find();