app/Models/CourseModel.php

SELECT `courses`.*, `users`.`name` as `teacher_name`, COUNT(DISTINCT enrollments.user_id) as active_users
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
LEFT JOIN `enrollments` ON `enrollments`.`course_id` = `courses`.`id`
GROUP BY `courses`.`id`
---
    public function getCoursesWithTeachersAndEnrollments()
    {
        return $this->select('courses.*, users.name as teacher_name, COUNT(DISTINCT enrollments.user_id) as active_users')
                    ->join('users', 'users.id = courses.instructor_id', 'left')
                    ->join('enrollments', 'enrollments.course_id = courses.id', 'left')
                    ->groupBy('courses.id')
                    ->findAll();