app/Models/EnrollmentModel.php

    public function getPendingRequestsForTeacher($teacher_id)
    {
        return $this->select('enrollments.*, courses.title as course_title, users.name as student_name, users.email as student_email')
                    ->join('courses', 'courses.id = enrollments.course_id')
                    ->join('users', 'users.id = enrollments.user_id')
                    ->where('courses.instructor_id', $teacher_id)
                    ->where('enrollments.status', 'pending')
                    ->orderBy('enrollments.enrollment_date', 'DESC')
                    ->findAll();
---
SELECT `enrollments`.*, `courses`.`title` as `course_title`, `users`.`name` as `student_name`, `users`.`email` as `student_email`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `courses`.`instructor_id` = 2
AND `enrollments`.`status` = 'pending'
ORDER BY `enrollments`.`enrollment_date` DESC