app/Models/NotificationModel.php

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '1'
AND `is_read` = 0
---
    public function getUnreadCount($userId)
    {
        return $this->where('user_id', $userId)
                    ->where('is_read', 0)
                    ->countAllResults();

SELECT *
FROM `notifications`
WHERE `user_id` = '1'
AND `is_read` = 0
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getNotificationsForUser($userId)
    {
        return $this->where('user_id', $userId)
                    ->where('is_read', 0)
                    ->orderBy('created_at', 'DESC')
                    ->limit(5)
                    ->findAll();

SELECT *
FROM `notifications`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 200
---
    public function getAllNotificationsForUser($userId, $limit = null, $offset = 0)
    {
        $builder = $this->where('user_id', $userId)
                        ->orderBy('created_at', 'DESC');

        if ($limit !== null) {
            return $builder->findAll($limit, $offset);